### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cosmos.module.azure-cosmos-account.azurerm_private_endpoint.sql must be replaced
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-fims-cosno-01")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_private_endpoint" "sql" {
      ~ custom_dns_configs            = [] -> (known after apply)
        custom_network_interface_name = null
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-fims-cosno-01" -> (known after apply)
        location                      = "italynorth"
      ~ name                          = "io-p-itn-fims-cosno-01" -> "io-p-itn-fims-cosno-pep-01" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-fims-cosno-01.nic.087bff1b-d228-4db5-bd72-dad5ec1f0b2f"
              - name = "io-p-itn-fims-cosno-01.nic.087bff1b-d228-4db5-bd72-dad5ec1f0b2f"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-fims-cosno-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.documents.azure.com"
              - name                = "privatelink.documents.azure.com"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-fims-cosno-01.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.253",
                        ]
                      - name         = "io-p-itn-fims-cosno-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-itn-fims-cosno-01-italynorth.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.254",
                        ]
                      - name         = "io-p-itn-fims-cosno-01-italynorth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        resource_group_name           = "io-p-itn-fims-rg-01"
      ~ subnet_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints" # forces replacement
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
          ~ "CreatedBy"      = "ARM" -> "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "Developer Experience" -> "IO Comunicazione"
          + "ModuleName"     = "azure_cosmos_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.0"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-fims-cosno-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            private_dns_zone_ids = [
                "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

      ~ private_service_connection {
            is_manual_connection              = false
          ~ name                              = "io-p-itn-fims-cosno-01_ec62eade-3b4a-4587-bd76-78a2b7e53020" -> "io-p-itn-fims-cosno-pep-01" # forces replacement
            private_connection_resource_alias = null
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourcegroups/io-p-itn-fims-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-fims-cosno-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-fims-cosno-01" # forces replacement
          ~ private_ip_address                = "10.20.2.253" -> (known after apply)
            request_message                   = null
            subresource_names                 = [
                "Sql",
            ]
        }
    }

  # module.web_apps_itn.module.op_app.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-app-01"
        name                                           = "io-p-itn-fims-op-app-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_app_autoscaler.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-fims-op-as-01"
        name                = "io-p-itn-fims-op-as-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_app_service_plan_autoscaler"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.1.3"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to import, 1 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cosmos.module.comsosdb_sql_container_op_access_tokens.azurerm_cosmosdb_sql_container.this,
  on .terraform/modules/cosmos.comsosdb_sql_container_op_access_tokens/cosmosdb_sql_container/main.tf line 7, in resource "azurerm_cosmosdb_sql_container" "this":
   7:   partition_key_path = var.partition_key_path

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and 11 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmos.cosmosdb_account_fims/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
